app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)


    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["text", "Test"], ["created_at", "2015-03-24 01:47:19.015741"], ["updated_at", "2015-03-24 01:47:19.015741"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "This is just a test that I have edited."], ["updated_at", "2015-03-24 02:36:53.062914"], ["id", 1]]

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]